PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
        int len = snprintf(g_relay_json_buffer, sizeof(g_relay_json_buffer),
                          "{"
                          "\"relay\":\"%.16s\","
                          "\"status\":\"%s\","
                          "\"timestamp\":%lld,"
                          "\"contact_type\":\"%s\","
                          "\"old_status\":\"%s\""
                          "}",
                          event->relay_id,
                          (event->new_state == RELAY_STATE_OK) ? "OK" : "DISC",
                          (long long)event->timestamp,
                          (event->contact_type == RELAY_CONTACT_NC) ? "NC" : "NO",
                          (event->old_state == RELAY_STATE_OK) ? "OK" : "DISC");
        
        if (len > 0 && len < sizeof(g_relay_json_buffer)) {
            char relay_topic[MQTT_TOPIC_MAX_LENGTH];
            esp_err_t topic_ret = mqtt_manager_get_panel_topic(relay_topic, sizeof(relay_topic), "relays");
            
            if (topic_ret == ESP_OK) {
                mqtt_manager_publish_json(relay_topic, g_relay_json_buffer, 1, false);
            } else {
                snprintf(relay_topic, sizeof(relay_topic), "esp32/%.8s/relays", g_esp32_id_buffer);
                mqtt_manager_publish_json(relay_topic, g_relay_json_buffer, 1, false);
            }
        }
        
        xSemaphoreGive(g_callback_mutex);
        return;
    }
    
    char *relay_json_buffer = malloc(json_size);
    if (!relay_json_buffer) {
        ESP_LOGE(TAG, "Failed to allocate relay JSON buffer");
        xSemaphoreGive(g_callback_mutex);
        return;
    }
    
    int len = snprintf(relay_json_buffer, json_size,
                      "{"
                      "\"relay\":\"%s\","
                      "\"status\":\"%s\","
                      "\"timestamp\":%lld,"
                      "\"contact_type\":\"%s\","
                      "\"old_status\":\"%s\","
                      "\"name\":\"%s\""
                      "}",
                      event->relay_id,
                      (event->new_state == RELAY_STATE_OK) ? "OK" : "DISC",
                      (long long)event->timestamp,
                      (event->contact_type == RELAY_CONTACT_NC) ? "NC" : "NO",
                      (event->old_state == RELAY_STATE_OK) ? "OK" : "DISC",
                      event->name);
    
    if (len > 0 && len < json_size) {
        char relay_topic[MQTT_TOPIC_MAX_LENGTH];
        esp_err_t topic_ret = mqtt_manager_get_panel_topic(relay_topic, sizeof(relay_topic), "relays");
        
        if (topic_ret == ESP_OK) {
            esp_err_t ret = mqtt_manager_publish_json(relay_topic, relay_json_buffer, 1, false);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "Relay %s state change published: %s -> %s", 
                        event->relay_id,
                        (event->old_state == RELAY_STATE_OK) ? "OK" : "DISC",
                        (event->new_state == RELAY_STATE_OK) ? "OK" : "DISC");
            }
        } else {
            snprintf(relay_topic, sizeof(relay_topic), "esp32/%.8s/relays", g_esp32_id_buffer);
            mqtt_manager_publish_json(relay_topic, relay_json_buffer, 1, false);
        }
    }
    
    free(relay_json_buffer);
    xSemaphoreGive(g_callback_mutex);
}

static esp_err_t relay_mqtt_command_callback(const char *topic, const char *command_json, void *user_data) {
    ESP_LOGI(TAG, "Processing relay MQTT command from topic: %s", topic);
    
    if (g_watchdog_available) {
        watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
    }
    
    return ESP_OK;
}

static void mqtt_state_callback(mqtt_manager_state_t state, void *user_data) {
    switch (state) {
        case MQTT_MANAGER_STATE_CONNECTED:
            ESP_LOGI(TAG, "MQTT connected");
            set_mqtt_connected(true);
            
            if (!get_relay_manager_initialized()) {
                ESP_LOGI(TAG, "Initializing Relay Manager after MQTT connection");
                esp_err_t ret = relay_manager_init();
                if (ret == ESP_OK) {
                    relay_manager_set_state_callback(relay_state_change_callback, NULL);
                    relay_manager_set_mqtt_callback(relay_mqtt_command_callback, NULL);
                    relay_manager_check_all_states(true);
                    set_relay_manager_initialized(true);
                    ESP_LOGI(TAG, "Relay Manager initialized successfully");
                } else {
                    ESP_LOGE(TAG, "Failed to initialize Relay Manager: %s", esp_err_to_name(ret));
                }
            }
            
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
                
                if (get_wifi_connected() && get_mqtt_connected()) {
                    watchdog_manager_set_mode(WATCHDOG_MODE_RUNNING);
                }
            }
            break;
            
        case MQTT_MANAGER_STATE_DISCONNECTED:
            ESP_LOGI(TAG, "MQTT disconnected");
            set_mqtt_connected(false);
            
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    ESP_LOGD(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        case MQTT_MANAGER_STATE_ERROR:
            ESP_LOGW(TAG, "MQTT error");
            set_mqtt_connected(false);
            break;
            
        default:
            break;
    }
}

static void mqtt_message_callback(const char *topic, const char *data, int data_len, void *user_data) {
    ESP_LOGI(TAG, "MQTT message: %s (%d bytes)", topic ? topic : "NULL", data_len);
    
    if (!topic || !data || data_len <= 0) {
        ESP_LOGE(TAG, "Invalid MQTT message");
        return;
    }
    
    if (g_watchdog_available) {
        watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
    }
    
    char *mqtt_temp_data;
    bool use_dynamic = false;
    
    if (data_len > sizeof(g_mqtt_temp_data) - 1) {
        if (esp_get_free_heap_size() < data_len + 8000) {
            ESP_LOGW(TAG, "Message too large and insufficient memory: %d bytes", data_len);
            return;
        }
        
        mqtt_temp_data = malloc(data_len + 1);
        if (!mqtt_temp_data) {
            ESP_LOGE(TAG, "Failed to allocate message buffer");
            return;
        }
        use_dynamic = true;
    } else {
        mqtt_temp_data = g_mqtt_temp_data;
    }
    
    memcpy(mqtt_temp_data, data, data_len);
    mqtt_temp_data[data_len] = '\0';
    
    if (esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)) != ESP_OK) {
        ESP_LOGE(TAG, "Could not get ESP32 ID");
        if (use_dynamic) free(mqtt_temp_data);
        return;
    }
    
    snprintf(g_mqtt_temp_topic, sizeof(g_mqtt_temp_topic), "esp32/notify/%s/deleted", g_esp32_id_buffer);
    
